[
  {
    "ksb": "K1",
    "ksb description": "Explain how current, relevant legislation impacts the safety of data projects.",
    "grading primer": "<p><strong>GDPR </strong>(General Data Protection Regulation) is an EU law that governs the collection, storage, and processing of personal data, ensuring individuals' privacy and holding organizations accountable.</p><br/><p><strong>The UK Data Protection Act</strong> is a law that governs the processing of personal data and safeguards individuals' privacy rights. It sets guidelines for how organizations should handle personal data, including its collection, storage, and use. The act also provides individuals with rights to access and correct their personal data, as well as rules for transferring personal data outside of the UK.</p><br/><p><strong>7 GDPR Principles:</strong></p><p>Lawfulness, Fairness, Transparency</p><p>Purpose Limitation</p><p>Data Minimization</p><p>Accuracy</p><p>Storage Limitation</p><p>Integrity and Confidentiality</p><p>Accountability</p><br/><p><strong>Anonymization and Privacy by Design:</strong></p><p>Anonymization removes personal identifiers to protect privacy, while Privacy by Design ensures data protection is integrated into systems from the start, reducing risks and ensuring compliance.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will need to tag the KSB correctly and resubmit before receiving a mark. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define GDPR or the UK Data Protection Act.",
      "Summarize the 7 principles of GDPR, or key principles of the UK Data Protection Act.",
      "Explain the impact of data legislation on data use in your role.",
      "Describe the importance of data legislation for a secure working environment.",
      "Explain the role of legislation in data security."
    ],
    "reconstructed exceed expectations criteria": [
      "Analyze alignment of your company's working practices with current legislation.",
      "Explain the need for anonymization and privacy by design.",
      "Explain how to implement best practices to enhance data project safety."
    ],
    "more work required feedback": "You need to include relevant legislation used in your organization and how it affects data safety. This is an important part of your project. If you work for a global company, look into specific data protection policies for your location, like GDPR in Europe or state-specific regulations in the US. Identify one policy and explain how it applies or does not apply to your project.\n\nRight now, not including this information leaves a gap in your analysis. To improve, think about how these regulations impact your data usage.\n\nNext, research the relevant data protection laws for your organization. Clearly explain how they relate to your project and consider how following these laws can shape your data management practices. You're making progress, and addressing this will strengthen your project!",
    "meets expectations feedback": "You’ve included relevant legislation related to the safe use of data in your organization, which is great. You've explained what the policy is and how it connects to your project. To take this further, consider discussing additional practices that could enhance the safety of your data projects.\n\nThink about what steps can be taken to ensure compliance and protect data more effectively. This will give you a more comprehensive view of data safety. You're on the right track, and adding this information will strengthen your project!",
    "exceeds expectation feedback": "\nYou’ve done a solid job outlining the relevant data security legislation for your organization and how it applies to safe data use. You’ve clearly explained the policy and its connection to your data usage in the project. Plus, you’ve evaluated your organization’s current practices and suggested areas for improvement.\n\nThis level of detail shows a good understanding of the topic. Keep building on this strong foundation, and consider how you can implement your recommendations for even better data security in the future!"
  },
  {
    "ksb": "K2",
    "ksb description": "Explain the organisational data and information security standards, policies and procedures relevant to data management activities.",
    "grading primer": "<p><strong>Data policy standards</strong> are guidelines for how organizations collect, store, manage, and use data securely and consistently, ensuring compliance with regulations. They cover data collection, storage, access, security, retention, and disposal, protecting both the organization and individuals' information while minimizing legal risks.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will need to tag the KSB correctly and resubmit before receiving a mark. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define and summarize your organization's data policies and standards.",
      "Describe how these policies impact your role and differentiate your contributions."
    ],
    "reconstructed exceed expectations criteria": [
      "Suggest 1 or more recommendation(s) to go beyond the standard in organizational data policies.",
      "Explain how you comply with organizational data policies and standards.",
      "Describe the implications of these policies and relevant standards."
    ],
    "more work required feedback": "You’ve only briefly mentioned relevant organizational policies and procedures. To improve, you should explain how these policies relate to your domain and their impact on your analysis approach.\n\nThink about how these policies guide your work and ensure compliance in your analysis. Providing more detail on this connection will strengthen your project. You're on the right track, so adding this context will enhance your work!",
    "meets expectations feedback": "You’ve included relevant policies and procedures related to your organization and discussed how they impacted your analysis. To enhance this further, consider explaining how you can go beyond the basic standards by incorporating privacy by design into your analysis approach.\n\nThink about how integrating privacy considerations from the start can improve your analysis and protect data. Adding this perspective will strengthen your project and demonstrate a proactive approach to data management. You're doing well, and this addition will take your work to the next level!",
    "exceeds expectation feedback": "You’ve confidently outlined the relevant policies and procedures related to your organization’s security and explained how they have impacted your analysis approach. You’ve also taken a step further by discussing how incorporating privacy by design can help achieve this standard of data security and have effectively integrated it into your analysis.\n\nThis shows a strong understanding of both the policies and the practical implications for data security. Great job! Keep building on this solid foundation!"
  },
  {
    "ksb": "K5",
    "ksb description": "Explain the differences between structured and unstructured data.",
    "grading primer": "<p><strong>Structured Data:</p><br/><p></strong>Definition: Organized, formatted data, typically in databases (e.g., SQL).</p><p>Characteristics: Fixed schema (tables, columns), consistent data types (integers, dates), easily searchable.</p><p>Examples: SQL databases, Excel sheets.<strong></p><br/><p>Unstructured Data:</p><br/><p></strong>Definition: Lacks predefined format/structure, includes diverse types and formats.</p><p>Characteristics: No fixed schema, contains text, images, videos, irregular and ambiguous.</p><p>Examples: Emails, social media posts, multimedia files.<strong></p><br/><p>Key Distinctions:</p><br/><p></strong>Data Model: Predefined in structured; none in unstructured.</p><p>Storage: Structured in databases; unstructured in flexible formats.</p><p>Data Types: Homogeneous in structured; varied in unstructured.</p><p>Query Capability: Easily queried for structured; complex for unstructured.</p><p>Evaluation Points:</p><br/><p>Describe data organization and format.</p><p>Explain why it is structured or unstructured.</p><p>Provide examples and contrast with the opposite data structure.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define structured data.",
      "Define unstructured data.",
      "Explain the difference between structured and unstructured data.",
      "Describe the characteristics of the data you work with."
    ],
    "reconstructed exceed expectations criteria": [
      "Describe how you mitigate the challenges of working with unstructured data with work-based examples.",
      "Identify and explain the challenges of working with unstructured data.",
      "Use relevant, work based examples to explain the challenges of working with unstructured data."
    ],
    "more work required feedback": "You have shown an initial understanding of structured and unstructured data, but more work is required to fully meet the criteria. Your definitions of structured and unstructured data need more precision and clarity. The explanation of the differences between the two types of data was too vague and lacked specific details. Additionally, the description of the characteristics of the data you work with was incomplete and needs further elaboration. You briefly touched on how structured data impacts your role, but a more in-depth explanation is necessary. The challenges of working with unstructured data were mentioned, but without the use of relevant, work-based examples, it is difficult to fully grasp the context and implications. To improve, provide clear and detailed definitions and explanations, and include specific, relevant examples from your work to illustrate the challenges of working with unstructured data. Keep striving to enhance your analysis in these areas for a more comprehensive understanding.",
    "meets expectations feedback": "You have met the expectations by clearly defining structured and unstructured data, successfully explaining their differences, and providing insightful descriptions of the data you work with. However, to achieve an \"exceeds expectations\" level, your examples and analysis, particularly regarding the challenges and mitigation strategies for unstructured data, could benefit from more detail. To meet this higher criterion, further explore the specific challenges of working with unstructured data and describe how you’ve mitigated these with concrete work-based examples. Expand your examples, elaborate on strategies used, and include measurable outcomes. Keep up the good work—your foundational understanding is strong, and these additions will further enhance your effectiveness.",
    "exceeds expectation feedback": "You exceeded expectations by thoroughly explaining the challenges of working with unstructured data using detailed, work-based examples. Your examples were specific and clearly illustrated the complexities and obstacles encountered in handling unstructured data. Additionally, your description of how you mitigate these challenges was comprehensive and insightful. You provided concrete, work-based examples that demonstrated effective strategies and solutions you have implemented. This detailed and practical approach not only highlighted your problem-solving skills but also showcased a deep understanding of the subject matter. Excellent work—your ability to analyze and address the challenges of unstructured data sets a high standard. Keep up the outstanding effort!"
  },
  {
    "ksb": "K15",
    "ksb description": "Explain the ethical aspects associated with the collation and use of data and justifies why this is important.",
    "grading primer": "<p><strong>Data for Analysis:</strong> Identify the data source, purpose, and collection method, ensuring adherence to legal and ethical standards.</p><p><strong></p><p>Ethical Aspects:</strong> Emphasize fairness, transparency, accountability, and consent in data handling.</p><br/><p><strong>Importance of Ethics: </strong>Ethical data use builds trust, complies with laws, and prevents legal consequences. Failing to uphold ethics risks breaches and reputational damage.</p><br/><p><strong>Bias in Data and AI:</strong> Bias leads to unfair outcomes and misinformed decisions, which can harm individuals and groups.</p><br/><p><strong>Ethical Evaluation with AI:</strong> Reference the Data Ethics Framework, ensuring fairness, transparency, and regular bias assessments to maintain accountability.</p><br/><p><strong>The UK Data Ethics Framework</strong> is a set of principles and guidelines that aim to ensure that data is used in a fair and ethical manner. It promotes transparency, accountability, and responsible data practices to protect individuals' privacy and rights. The framework is designed to help organizations make ethical decisions when collecting, storing, and using data.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will need to tag the KSB correctly and resubmit before receiving a mark. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Explain the data used for your analysis, including its source, purpose, and how it was collected.",
      "Describe the ethical aspects of data collation and use in this project, emphasizing fairness, transparency, accountability, and consent (refer to the UK Government's Data Ethics Framework).",
      "Justify the importance of ethical considerations and the consequences of not following ethical standards.",
      "Explain why bias is an ethical issue and how it impacts data projects."
    ],
    "reconstructed exceed expectations criteria": [
      "Compare the key elements of the Data Ethics Framework with your own work or role. Evaluate how these principles affect your work, why they are important, and prioritize them based on their impact"
    ],
    "more work required feedback": "You're missing an explanation of the ethical aspects associated with collating and using data. It’s important to consider what ethical considerations should be taken into account when gathering information from customers, clients, or internal and external systems.\n\nYou might want to discuss issues like consent, accountability, fairness, and transparency, and relate them to your data usage. By addressing these points, you'll be able to justify why they are important considerations, especially in the context of your project. This addition will strengthen your analysis and show your understanding of the ethical implications of data handling. Keep up the good work!",
    "meets expectations feedback": "You've provided a solid explanation of the ethical aspects associated with collating and using data, including important considerations like consent, accountability, fairness, and transparency. You’ve related these issues to your data usage and clearly justified why they are significant, particularly in the context of your project.\n\nTo improve this further, consider evaluating the ethical considerations specifically within your project. You might also elaborate on related issues that extend beyond your project, such as the use of AI and Big Data, and how they can affect ethical practices. This additional context will enhance your analysis and demonstrate a comprehensive understanding of the ethical implications. Great work so far!",
    "exceeds expectation feedback": "You've clearly explained the ethical aspects associated with collating and using data, including important considerations like consent, accountability, fairness, and transparency. You've effectively discussed these ethical issues and related them to your data usage, providing a solid justification for why they are significant, especially in the context of your project.\n\nAdditionally, you've gone further by evaluating the ethical considerations within your project and elaborating on related issues that extend beyond it, such as the use of AI and Big Data. This depth of analysis demonstrates a strong understanding of the ethical implications involved. Great job! Keep up the excellent work!"
  },
  {
    "ksb": "B1",
    "ksb description": "Explain how to contribute towards a productive, safe, and secure working environment.",
    "grading primer": "<p>Examples of safe, secure, and productive working environment examples: </p><br/><p><strong>Safe Working Environment </strong></p><br/><p>Implement comprehensive cybersecurity policies and training to protect against digital threats, including regular software updates and secure data backups.</p><br/><p><strong>Secure Working Environment</strong></p><br/><p>Establish and maintain robust data protection measures, such as encryption, multi-factor authentication, and access controls, in compliance with data protection regulations like UK GDPR.</p><br/><p><strong>Productive Working Environment</strong></p><br/><p>Use efficient tools and systems to streamline workflows and enhance productivity, ensuring that these tools adhere to relevant regulations and maintain data security.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will need to tag the KSB correctly and resubmit before receiving a mark. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Demonstrate how you ensure a safe working environment by adhering to relevant standards (e.g. Data protection framework).",
      "Explain how you maintain a secure working environment by implementing and following relevant data protection and security regulations.",
      "Describe how you support and enhance productivity in the workplace."
    ],
    "reconstructed exceed expectations criteria": [
      "Explain how to create processes and resources to educate others in building a productive, safe, and secure working environment.",
      "Provide an example of communicating the importance of a productive, safe, and secure working environment."
    ],
    "more work required feedback": "You haven't explained how your role contributes to a productive, safe, and secure working environment. Think about how you work with data and what procedures or policies you need to follow, like Safe Data Use, Privacy by Design, GDPR, or other relevant legislation.\n\nIncluding this information will help clarify your responsibilities and how they support a secure environment. Focus on how your actions align with these policies, and it will strengthen your project. You're making good progress, and this addition will enhance your work!",
    "meets expectations feedback": "You've explained how your role contributes to a productive, safe, and secure working environment. You've considered how you work with data and described the procedures or policies you need to follow, such as Safe Data Use, Privacy by Design, GDPR, and other relevant legislation.\n\nTo enhance this further, think about suggesting potential processes or resources that could improve productivity, safety, or security in your working environment. This could include tools, training, or best practices. You're doing well, and adding these ideas will strengthen your project even more!",
    "exceeds expectation feedback": "You've provided an excellent explanation of how your role contributes to a productive, safe, and secure working environment. You’ve thoughtfully considered how you work with data and described the procedures or policies you need to follow, such as Safe Data Use, Privacy by Design, GDPR, and other relevant legislation.\n\nYou’ve also gone above and beyond by evaluating current practices and suggesting potential processes or resources to enhance productivity, safety, and security in your working environment. This level of detail demonstrates a strong understanding of your responsibilities. Keep up the great work!"
  },
  {
    "ksb": "B5",
    "ksb description": "Identify the true root cause of a problem and create a solution which prevents recurrence.",
    "grading primer": "<p>Identifies <strong>true root cause of a problem</strong></p><p>and a <strong>solution </strong>which <strong>prevents recurrence</strong>.</p><br/><p>Meets Expectations:\r</p><p>Learners should identify a problem with an unknown cause and outline the steps taken to determine the true root cause. They must clearly describe these steps and explain the discovered root cause. The solution proposed should be well-communicated and demonstrate how it addresses and prevents recurrence. Evidence can include a detailed breakdown of the problem-solving process, communications with stakeholders illustrating the rationale behind the solution, and witness statements confirming the effectiveness in preventing recurrence.\r</p><p>\r</p><p>Exceeds Expectations:\r</p><p>Learners are expected to provide a rigorous analysis of the problem, employing advanced techniques to identify the root cause. They should justify how these steps built organizational buy-in for their solution, using evidence like testimonials from team members and documentation of enhanced team processes. The solution should exemplify innovative thinking and demonstrate strategic foresight in preventing future issues. Evidence may include data showing improved performance metrics, screenshots of systematic changes, and stakeholder endorsements that highlight team-wide adoption and support.\r</p><p>\r</p><p>Practical evidence includes problem and solution documentation, emails or messaging threads showing stakeholder discussions, and metrics showing the effectiveness of the implemented solution.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Outline a problem you were having with an unknown cause",
      "Describe the steps you took to identify the true root cause of this problem",
      "Explain the root cause of the problem.",
      "Reveal the solution to this problem",
      "Highlight that this issue will not reoccur"
    ],
    "reconstructed exceed expectations criteria": [
      "Describe how you have clearly outlined your steps to identify the root cause of the problem referenced in your project.",
      "Justify why these steps can or have created buy-in for your solution, across a team or your wider organization.",
      "Describe how your solution can help to prevent the recurrence of the problem, or similar problems in the future."
    ],
    "more work required feedback": "You have described a problem/problems you have faced during your project but not explained fully how you have identified the true root cause of it/them. You should explain how you went about investigating any problems within the project scope, why you did so and how you uncovered the root cause of your problem (e.g. did you look at the data and discover a recurring issue? Was a system/process broken in your workflow?). Once you have identified the true root cause of the problem, explain how you have gone on to prevent it happening again (e.g. did you recreate a master file? Did you flag the problem to relevant stakeholders to fix?).",
    "meets expectations feedback": "You have described a problem/problems you have faced during your project and fully explained how you have identified the true root cause of it/them. You have outlined how you went about investigating any problems within the project scope, why you did so and how you uncovered the root cause of your problem (e.g. you looked at the data and discovered a recurring issue or identified a system/process broken in your workflow). You have provided a good explanation of how you have gone on to prevent it happening again. To extend this further, you could evaluate the solution you have provided and suggest other potential solutions that could be used in future.",
    "exceeds expectation feedback": "You have clearly articulated a problem/problems you have faced during your project and fully explained how you have identified the true root cause of it/them. You have discussed how you went about investigating any problems within the project scope, why you did so and how you uncovered the root cause of your problem (e.g. you looked at the data and discovered a recurring issue or identified a system/process broken in your workflow). You have provided an excellent explanation of how you have gone on to prevent it happening again. Additionally, you have evaluated the solution you have provided and suggested other potential solutions that could be used in future."
  },
  {
    "ksb": "K6",
    "ksb description": "Describe the fundamentals of data structures and database system design and explain how they are implemented and maintained.",
    "grading primer": "<p><strong>Database</strong>: data is stored in an organized manner which is optimized for fast data retrieval.</p><p><strong>Data Warehouse</strong>: data is extracted from different databases, transformed and loaded into one central database. This is optimized for fast data analysis and decision-making.</p><p><strong>Data Lake</strong>: data is stored in its raw format with no predefined structure. This is used for storing varied data for richer insights.</p><p><strong>Relational Database</strong>: a structured way of storing and organizing data in tables with predefined relationships between them. </p><p><strong>NoSQL Database</strong>: a flexible and scalable approach to storing data that does not follow the traditional relational model, making it suitable for handling diverse data formats and prioritizing availability and performance.</p><br/><p><strong>Normalisation </strong>is a process to organize the data in a database efficiently.</p><p>It aims to:</p><ul><li>Reduce the repetition of data (redundancy).</li><li>Increase data accuracy and reliability (integrity).</li></ul><br/><p><strong>1st Normal Form </strong>tells us how data should be stored in a table:</p><ul><li>Each column must have a unique name.</li><li>Each column must contain atomic values (i.e. the data should not be able to be broken down further).</li><li>The information must not rely on the way it is sorted.</li></ul><p><strong>2nd Normal Form </strong>splits databases into relevant and related tables:</p><ul><li>The database must meet the requirements of the 1st Normal Form.</li><li>Every table must have a primary (or composite) key.</li><li>All columns must be relevant to all parts of the primary (or composite) key (no partial dependencies).</li></ul><p><strong>3rd Normal Form </strong>ensures all data in a table is absolutely relevant:</p><ul><li>The database must meet the requirements of the 2nd Normal Form.</li><li>There must be no transitive dependencies (all columns must be dependent on the primary key, if a column is related to another non-primary key column it should be in a different table).</li><li>There must be no calculated fields (no column should be able to be determined or inferred from another column).</li></ul><br/><p><strong>ETL </strong>stands for \"extract, transform, and load\" and is a data integration process that combines data from different sources into a single repository: </p><p>Extract: Collect data from various sources </p><p>Transform: Clean and organize the data using business rules </p><p>Load: Store the data in a target system, such as a data warehouse, data lake, or business intelligence reporting system </p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define key terms in database systems and architecture: (Database, data warehouse, data lake, relational database, non-relational/NoSQL database, normalization, ETL)",
      "Provide any examples of these terms that you work with at your organization(e.g. Azure, BigQuery, etc.)",
      "Explain how database systems are maintained (consider the following: ETL, Normalisation, ERDs)",
      "Explain how databases are interacted with (consider SQL queries, APIs)"
    ],
    "reconstructed exceed expectations criteria": [
      "Explain how data warehouses, relational databases, normalization, ETL, and NoSQL work and their uses.",
      "Define relational databases and their key features.",
      "Include a simple entity relationship diagram (ERD) to show the database structure."
    ],
    "more work required feedback": "You've explained what data you are using, but you haven’t described its structure. To strengthen this section, provide an explanation of the data structures you've used and how they fit within your organization’s database system.\n\nAdditionally, explain how the database is implemented and maintained. If your organization doesn’t currently use databases, discuss how and why they could be beneficial, along with ideas for how they could be implemented and maintained. Adding this detail will enhance your understanding of the data context and its importance within your organization. You're on the right track—keep it up!",
    "meets expectations feedback": "You've explained what data you are using and its structure effectively. You've provided a solid explanation of the data structures you've used, how they fit within your organization’s database system, and how the database is implemented and maintained. If your organization doesn't use databases, you've clearly indicated how and why they could be beneficial, along with suggestions for implementation and maintenance.\n\nTo enhance this further, consider critically evaluating your organization’s use of databases. You could suggest alternatives, such as comparing NoSQL versus SQL databases, and discuss the potential benefits or drawbacks of each. This analysis will deepen your understanding of database choices and their implications for your organization. Great job! Keep it up!",
    "exceeds expectation feedback": "You've provided an excellent explanation of the data you are using and its structure. Your solid explanation of the data structures, how they fit within your organization’s database system, and how the database is implemented and maintained demonstrates a strong understanding of the topic.\n\nIf your organization doesn't use databases, you've effectively indicated how and why they could be beneficial, along with suggestions for implementation and maintenance. Additionally, you’ve critically evaluated your organization’s use of databases and suggested alternatives, such as comparing NoSQL versus SQL databases.\n\nThis level of detail showcases your comprehensive grasp of the subject. Great work! Keep it going!"
  },
  {
    "ksb": "K7",
    "ksb description": "Explain the principles of user experience and domain context for data analytics.",
    "grading primer": "<p>User Experience - User experience (UX) is the overall experience a user has when interacting with a product, service, or company. It's a broad term that includes how easy a product is to use, how well it fits into a user's workflow, and how relevant the content is. It also includes the emotions and perceptions a user has during and after their interaction. </p><br/><br/><p>Domain knowledge - is the knowledge and expertise that someone has in a specific field or discipline. It's different from general knowledge and is important for problem solving and thinking within a specific area</p><br/><p>Principles of UX - </p><p>User-Centric Design</p><p>Usability</p><p>Data Accessibility</p><p>Visual Clarity</p><p>Adaptability</p><p>Feedback</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define user experience (UX).",
      "Summarise the principles of UX.",
      "Explain why UX should be considered in your analysis approach.",
      "Define domain context.",
      "Explain why domain context should be considered in your analysis approach."
    ],
    "reconstructed exceed expectations criteria": [
      "Provide examples of best practice regarding UX",
      "Provide examples where your domain context has enabled you to better perform your role within data",
      "Provide examples of how domain context can be incorporated into UX."
    ],
    "more work required feedback": "Your work included thoughtful visualizations and analyses, but it would benefit from more explanation of how you considered user experience and domain context.\n\n For example, why did you choose specific visual elements, such as chart types, colors, or layouts? Did you think about accessibility in the design? While the analysis is strong, enhancing your explanation of these choices in relation to the business or industry context will help. Keep up the good work! \n\nRevising the section on user experience and domain relevance will strengthen your project and align more clearly with the assessment criteria. I look forward to seeing your updated approach!",
    "meets expectations feedback": "You've done a great job explaining how you considered user experience and domain context when creating visualizations and running analyses, including your choice of graph types, colors, layout, and accessibility considerations. You clearly outlined the principles of user experience and how your industry context shapes your work. \n\nTo further improve, try providing an evaluation of your visualizations or analyses based on your domain knowledge and user experience insights. This added reflection will enhance the depth of your work. Keep up the good progress, and I look forward to seeing your refined evaluation!",
    "exceeds expectation feedback": "You have confidently and succinctly explained how you considered user experience and domain context when creating visualisations/running analyses. You have clearly explained the type of graph/chart/visualisation you have used, your use of colours/layout, and any accessibility considerations. You outlined the relevant principles of user experience and explained the domain context within which you work. You have also critically evaluated the visualisation/analyses you have made based on your knowledge of your domain and user experience considerations."
  },
  {
    "ksb": "S5",
    "ksb description": "Assess the impact of user experience and domain context on a data project.",
    "grading primer": "<p><strong>User Experience</strong> - User experience (UX) is the overall experience a user has when interacting with a product, service, or company. It's a broad term that includes how easy a product is to use, how well it fits into a user's workflow, and how relevant the content is. It also includes the emotions and perceptions a user has during and after their interaction. </p><br/><p><strong>Principles of UX</strong> - \r</p><p>User-Centric Design\r</p><p>Usability\r</p><p>Data Accessibility\r</p><p>Visual Clarity\r</p><p>Adaptability\r</p><p>Feedback</p><br/><p><strong>Domain knowledge</strong> - is the knowledge and expertise that someone has in a specific field or discipline. It's different from general knowledge and is important for problem solving and thinking within a specific area</p><br/><br/>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Describe the UX design considerations you have made for visualisations/dashboard",
      "Describe how your visualisations/dashboard meets the requirements of your stakeholder (layout, colour palette, accessibility)",
      "Provide an example where you have used your domain context during the project",
      "Explain your UX choices (for example: layout, color palette)",
      "Explain how you have ensured your visualisations are accessible."
    ],
    "reconstructed exceed expectations criteria": [
      "Use visible evidence to support your claims (if applicable).",
      "Discuss the impact on stakeholders your design choices have made. If possible include feedback as evidence.",
      "Suggest possible ways to further enhance the usability of your visualisations or dashboard."
    ],
    "more work required feedback": "You have included visualisations and/or analyses but not assessed the impact of user experience and/or domain context when creating them (e.g. What was the business/stakeholder feedback on the visualisations you created/analyses you ran?). Make sure you explain how you have assessed user experience and the domain context in which you work, including examples of stakeholder feedback.",
    "meets expectations feedback": "You have assessed the impact of user experience and domain context when creating your visualisations/conducting your analyses. You have provided relevant examples from your project and included feedback from stakeholders. To enhance this, you could provide additional recommendations based on your knowledge of your stakeholders/business and explain the steps you have taken to improve your project based on stakeholder feedback.",
    "exceeds expectation feedback": "You have skilfully assessed the impact of user experience and domain context when creating your visualisations/conducting your analyses. You have provided solid examples from your project and included relevant feedback from stakeholders, clearly articulating how you actioned their feedback. You have also gone above and beyond by including additional recommendations/critical evaluation based on your knowledge of your stakeholders/business."
  },
  {
    "ksb": "S14",
    "ksb description": "Create infographics, reports, tables, dashboards and graphs to effectively display the results of qualitative and quantitative data analysis.",
    "grading primer": "<p><strong>Qualitative data</strong> - non-numerical information that describes qualities and characteristics that can't be measured with numbers.</p><p>Eg: </p><ul><li>Open-ended survey responses</li><li>Free-text Notes column in a spreadsheet</li><li>Interview transcripts</li></ul><br/><p><strong>Quantitative data </strong>- data that is represented numerically and can be measured or counted and calculations can be performed with it.</p><p>Eg: </p><ul><li>Quarterly sales figures </li><li>Emissions figures</li><li>Number of orders</li></ul>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Provide examples or screenshots of visualisations that display quantitative data.",
      "Provide examples or screenshots of visualisations that display qualitative data.",
      "Describe the insights that can be derived from a visualisation.",
      "Explain your rationale for selecting a specific type of visual in relation to your data and insights you wish to convey."
    ],
    "reconstructed exceed expectations criteria": [
      "Identify two or more different visualization approaches that could be used to display a dataset",
      "Compare and contrast the benefits of using each visualization,considering your stakeholders requirements",
      "Provide the rationale for choosing the visualisation that best meets your stakeholders needs"
    ],
    "more work required feedback": "Your project is missing relevant and/or appropriate visualisations (e.g. infographics, reports, tables, dashboards and/or graphs). Ensure that you include appropriate visualisations (relevant to your data analysis activity) that illustrate both quantitative (e.g. cost over time) and qualitative data (e.g. total numbers per category), and that you interpret and explain their output.",
    "meets expectations feedback": "You have included and explained relevant and appropriate visualisations (e.g. infographics, reports, tables, dashboards and/or graphs). You have used appropriate visualisations that illustrate both quantitative (e.g. cost over time) and qualitative data (e.g. total numbers per category), and have provided a good interpretation and explanation of their output. To boost this further you should compare and contrast different data visualisation approaches (e.g. is a table more appropriate that a dashboard? Is a bar chart better than a pie chart?) and how they aid understanding by stakeholders.",
    "exceeds expectation feedback": "You have included and confidently explained relevant and appropriate visualisations (e.g. infographics, reports, tables, dashboards and/or graphs). You have skilfully chosen appropriate visualisations that illustrate both quantitative (e.g. cost over time) and qualitative data (e.g. total numbers per category), and have provided an excellent interpretation and explanation of their output. You have also compared and contrasted different data visualisation approaches, explaining and evaluating how they aid understanding by stakeholders."
  },
  {
    "ksb": "B2",
    "ksb description": "Proactively adapt data activities to meet minor unexpected changes at work and take full responsibility for solving problems within the project scope. ",
    "grading primer": "<p>Learners must <strong>adapt </strong>their activities, to meet minor unexpected changes (and describe evidence of this). </p><br/><p>It is not sufficient to gather stakeholder needs and then implement them. They must act of their own accord to meet the KSB.</p><p><strong></p><p></strong>Terms to Define:\r</p><p>\r</p><p>Preemptive Actions: Initiatives taken to anticipate potential changes or issues to minimize their impact.\r</p><p>Scope of the Project: The detailed framework outlining project goals, tasks, costs, and timelines.</p><p>\r</p><p>Meets Expectations:\r</p><p>Learners should detail how they have proactively adapted data activities to preempt significant changes at work. They must showcase their responsibility in resolving issues within the project's scope. Evidence can include screenshots of revised workflows or data systems, witness statements confirming the learner’s role, and communications that demonstrate problem-solving outcomes. The connection between proactive adjustments and improved project effectiveness should be clear.\r</p><p>\r</p><p>Exceeds Expectations:\r</p><p>Learners should provide a comprehensive analysis of preemptive strategies and innovative problem-solving that notably enhances project results. They should offer evidence such as detailed emails or message threads showing stakeholder management, testimonials from colleagues or supervisors, and screenshots illustrating strategic use of tools or systems. The analysis must highlight strategic foresight and how these proactive measures resulted in significant project advances.\r</p><p>\r</p><p>Practical evidence includes system updates, stakeholder communications, project performance metrics, and documented proof of the learner's initiative and problem-solving skills.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Outline an unexpected change at work",
      "Describe what adjustments you have made in order to adapt to this change"
    ],
    "reconstructed exceed expectations criteria": [
      "Describe how you proactively adapt data activities to pre-empt major changes at work.",
      "Describe how you take full responsibility for solving problems within the scope of the referenced project."
    ],
    "more work required feedback": "You have described minor problems you have faced during your project but not explained fully how you have adapted your activities in the face of these problems. You should explain what initiative you have taken to solve any problems within the project scope and why it was necessary to do (e.g. did you have to take a different approach to sourcing, cleansing and/or preparing your data? Did you have to adapt your activities to use a different tool? Did you have to change your output due to unexpected reasons/stakeholder expectations?).",
    "meets expectations feedback": "You have described minor problems you have faced during your project and explained how you have adapted your activities in the face of these problems. You explained what initiative you have taken to solve any problems within the project scope and why it was necessary to do. For example, you will have explained if you had to take a different approach to sourcing, cleansing and/or preparing your data or if you had to adapt your activities to use a different tool or change your output due to unexpected reasons/stakeholder expectations. To boost this, you should describe any major issues you faced and how you adapted your project as a result to meet additional/amended requirements.",
    "exceeds expectation feedback": "You have clearly outlined both minor and major problems you have faced during your project and explained how you have adapted your activities in the face of these problems. You explained what initiative you have taken to solve any problems within the project scope and why it was necessary to do. For example, you will have explained if you had to take a different approach to sourcing, cleansing and/or preparing your data or if you had to adapt your activities to use a different tool or change your output due to unexpected reasons/stakeholder expectations. You have also evaluated whether the changes you had to make were appropriate and offered alternative solutions for potential future steps."
  },
  {
    "ksb": "K10",
    "ksb description": "Explain approaches to combining data from different sources to improve accuracy, efficiency and maximise benefits to the organisation and customers.",
    "grading primer": "<p>Terms to Define:\r</p><p>\r</p><p>Inner Join: Combines records from two tables where there is a match in both; requires a common key.\r</p><p>Left Join: Includes all records from the first table and matches from the second; unmatched returns null.\r</p><p>Outer Join: Includes all records from both tables, matching where possible; unmatched returns null.\r</p><p>Union: Appends two queries vertically, requiring the same number of columns with compatible data types.\r</p><p>Keys: Unique identifiers in databases, such as primary (unique within a table), foreign (links between tables), and composite (combination of two or more columns).</p><p>\r</p><p>Meets Expectations:\r</p><p>Learners should describe the challenges faced in joining data using different techniques and evaluate the benefits and risks of combining data from various sources. Evidence can include practical examples of data scenarios, screenshots of joins performed, and risk-benefit analyses submitted as reports or visual presentations that show improved accuracy, efficiency, or benefits to the organization or customers.\r</p><p>\r</p><p>Exceeds Expectations:\r</p><p>Learners should provide in-depth evaluations using advanced techniques to overcome challenges in data joining. They must illustrate comprehensive benefits and risk mitigation strategies, substantiated by detailed case studies or project documentation. Evidence can consist of advanced examples of data manipulation, detailed stakeholder testimonials, or metrics highlighting significant enhancements in data handling and organizational performance post-integration.\r</p><p>\r</p><p>Practical evidence includes transformation scripts, database management screenshots, communication logs with stakeholders about data integration outcomes, and documented impacts on organizational processes or customer satisfaction.<strong>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p>\r</p><p></strong></p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define the main types of joins (left, inner, outer, union)",
      "Define Unions (could be part of point 1)",
      "Define keys (foreign, primary, composite)",
      "Explain how combining data from different sources improved accuracy and/or efficiency and/or maximized benefits to your organization and/or customer."
    ],
    "reconstructed exceed expectations criteria": [
      "Describe any challenges you had in joining data.",
      "Evaluate the benefits and risks of combining data from different sources in your role."
    ],
    "more work required feedback": "Understanding of data combination is developing, but further work is needed in defining join types and how they impact organizational efficiency and strategy. Address risks and benefits comprehensively with examples to strengthen your understanding. Explore different data joining methods and reflect on how they enhance both your projects and organizational strategy.",
    "meets expectations feedback": "You have outlined data combination processes, explaining different joins used in data projects and how they increase data accuracy and efficiency. To expand on this, integrate detailed evaluations of both benefits and risks using concrete examples.",
    "exceeds expectation feedback": "Exemplary explanation of data combination processes, evaluating both benefits and risks with comprehensive, practical examples. Your analysis illuminates how these methods drive organizational improvements. Document challenges and solutions encountered during implementations for stronger, future-facing strategies"
  },
  {
    "ksb": "K13",
    "ksb description": "Explain the principles of statistics for analysing datasets.",
    "grading primer": "<p>While <strong>descriptive statistics </strong>summarise the characteristics of a data set, <strong>inferential statistics</strong> help you come to conclusions and make predictions based on your data.</p><br/><p>When you have collected data from a sample, you can use inferential statistics to understand the larger population from which the sample is taken. </p><br/><p>Highlight how descriptive and inferential statistics can aid decision making. </p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Define and explain the purpose of descriptive statics, including their purpose and examples of use (including mean, median, mode, standard deviation).",
      "Define and explain the purpose of inferential statistics (including hypothesis testing, t-test, significance level, and p-value).",
      "Give examples of your use of either or both of these forms of statistics in your project."
    ],
    "reconstructed exceed expectations criteria": [
      "Explain how descriptive statistics are used in your work and/or in your project to aid decision making.",
      "Explain how inferential statistics are used at your work and/or in your project to provide information about a population from a sample.",
      "Explain why a specific statistical test(s) was/were most appropriate for addressing your hypothesis(es)",
      "Discuss the importance of hypothesis testing in data analysis and its implications for drawing conclusions."
    ],
    "more work required feedback": "You've made a good start by defining some key statistical terms, such as mean, median, and mode, and providing a basic explanation of descriptive and inferential statistics. It’s clear that you have a foundational understanding of these concepts.\n\nHowever, to fully meet the criteria, you need to include definitions for all the required terms, such as variance, null hypothesis, alternative hypothesis, significance level, and p-value. These are critical for understanding statistical analysis, and their absence leaves gaps in your explanation. Additionally, expanding on how both descriptive and inferential statistics are used, with relevant examples, would strengthen your submission.\n\nTo improve, revisit these missing elements and provide a more complete explanation of the concepts. Keep going, and with these additions, you’ll have a much more comprehensive analysis.",
    "meets expectations feedback": "You provided clear and accurate definitions of both descriptive and inferential statistics, effectively explaining their purposes and giving relevant examples. The definitions of key statistical terms, such as mean, median, mode, variance, null hypothesis, alternative hypothesis, significance level, and p-value, were well-structured and precise.\n\nTo improve, consider providing a bit more context around how these statistical concepts apply to real-world datasets, particularly in relation to any work or projects you are involved in. This will help bridge the gap between theoretical knowledge and practical application.\n\nGreat job overall—adding more examples from your work would further enhance your explanation.",
    "exceeds expectation feedback": "Your explanation of how inferential statistics are used in your work or project was excellent, showing a deep understanding of their role in predicting population characteristics from a sample. The discussion on hypothesis testing was well-rounded, demonstrating its importance in data analysis and the impact it has on drawing accurate conclusions. Furthermore, your explanation of why specific statistical tests were chosen in your project was insightful and clearly justified.\n\nTo push this even further, consider discussing how alternative statistical approaches could be applied in different situations and the potential advantages or disadvantages they might present. This would offer a broader perspective on the use of statistical tests in various contexts.\n\nFantastic work overall—your thoughtful explanations and well-justified choices clearly reflect a high level of expertise!"
  },
  {
    "ksb": "S9",
    "ksb description": "Identify the relevant tools and techniques for an organisational data architecture, and how the requirements might change in different organisations.",
    "grading primer": "<p><strong>Data Architecture:</strong> A framework for how an organization collects, stores, and manages data.</p><br/><p><strong>Organizational Data Architecture:</strong> Describe how your organization structures and accesses data (e.g., relational databases, cloud systems).</p><br/><p><strong>Tools for Analysis:</strong> Highlight tools used (e.g., SQL, Python) for querying, cleaning, and analysis.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will need to tag the KSB correctly and resubmit before receiving a mark. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Describe the tools or techniques you have used for data analysis in your role (you may also wish to evidence this use with a screenshot).",
      "Justify the rationale for using these data analysis tools or techniques, based on the data architecture of your organization."
    ],
    "reconstructed exceed expectations criteria": [
      "Describe the strengths and weaknesses of at least 2 tools and/or techniques used in data architectures."
    ],
    "more work required feedback": "It's great to see your effort in describing the tools and techniques you use for data analysis. However, there are areas to improve, especially in linking your tool choices to your organization's data architecture.\n\nYou would benefit from providing a clearer rationale for why these tools/techniques are utilized, specifically how they align with your organization's architectural needs and objectives. Moreover, including a comparison of at least two tools/techniques with detailed strengths and weaknesses would strengthen your submission.\n\nConsider delving deeper into understanding the interplay between your data tools and your organization's architecture. Try to identify core strengths and weaknesses of different tools you use, perhaps by engaging in online courses or reading relevant articles. This will enrich your understanding and improve future submissions.",
    "meets expectations feedback": "You've effectively described the data analysis tools or techniques used in your role and justified your choice based on your organization's data architecture. Well done on aligning your tools with architectural requirements. \n\nHowever, to push your feedback into the 'exceeds expectations' category, a thorough analysis comparing the strengths and weaknesses of at least two tools or techniques would be beneficial. This would demonstrate a deeper level of understanding and critical thinking. \n\n You've made a strong connection between your data analysis practices and the organizational architecture. Keep building on this by experimenting with different tools and reflecting on their effectiveness. Document your findings, which will be useful for your long-term professional development.",
    "exceeds expectation feedback": "Excellent work! You have clearly described the data analysis tools and techniques you use and have justified their use in the context of your organization's data architecture. Additionally, you've gone further to critically evaluate the strengths and weaknesses of multiple tools, demonstrating a thorough understanding. \n\nYou're clearly on the right track and showcasing a solid grasp of data analysis within the framework of organizational architecture. Continue exploring new tools and technologies to stay ahead. As you expand your expertise, consider sharing your insights with peers or in professional forums to contribute to the field's knowledge base. Keep up the fantastic work!"
  },
  {
    "ksb": "S10",
    "ksb description": "Apply the principles of statistics for analysing datasets.",
    "grading primer": "<p>The application of statistical methodologies (e.g., descriptive statistics, inferential statistics) can provide valuable insights.</p><br/><p>Apprentices should be able to demonstrate that they can apply and correctly interpret descriptive statistics to address an appropriate business problem.</p><br/><p>Apprentices should be able to clearly justify their choice of descriptive/summary statistics for a given variable or analysis. This might include a clear contrast or discussion of other alternatives and when/why they may or may not be appropriate. </p><br/><p>Apprentices should be able to clearly justify their choice of inferential test in the context of the presented hypotheses and the available data. This might include a clear contrast or discussion of alternative approaches and when/why they may or may not be appropriate. </p><br/><p>Apprentices should be able to demonstrate that they can apply and correctly interpret inferential statistics/test to address an appropriate hypothesis. This should include interpretation of relevant test statistics, p-values and/or other available information from an inferential analysis. Additionally, apprentices may highlight their choice of alpha level in relation to controlling type-I error rates. </p><br/>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Use descriptive statistics to summarize data, highlighting key quantities such as mean, median, mode, standard deviation, and minimum/maximum values.",
      "Conduct exploratory data analysis (EDA) to describe what the data shows.",
      "Incorporate appropriate visualizations, such as bar charts and scatter plots, to enhance data interpretation and presentation.",
      "Clearly articulate null and alternative hypotheses relevant to your analysis.",
      "Explain, apply and interpret an inferential test (e.g., Pearson' correlation, t-tests, binomial test, linear regression, logistic regression).",
      "Correctly interpret p-values in the context of hypothesis testing and data analysis."
    ],
    "reconstructed exceed expectations criteria": [
      "Justify your choice of descriptive statistics for the given data in the context of the data and the business problem, presenting possible alternatives.",
      "Justify your choice of inferential test given the data and proposed hypotheses, presenting possible alternatives.",
      "Explain your choice of alpha level in the context of risk associated with decisions made about the data in questions."
    ],
    "more work required feedback": "You've made a solid start by summarizing some key data using descriptive statistics, including mean, median, and mode, which shows an understanding of the basics. However, to meet the expectations, you need to complete the exploratory data analysis (EDA) and ensure all statistical quantities, such as variance and minimum/maximum values, are covered. Additionally, your hypotheses (null and alternative) should be clearly articulated and relevant to your analysis.\n\nThere was also a lack of explanation and application of Pearson’s correlation coefficient, as well as interpretation of p-values, which are crucial for accurate data analysis. Incorporating visualizations such as bar charts or scatter plots would greatly enhance your data presentation.\n\nTo improve, address these missing elements and add relevant visual aids to support your analysis. This will help bring your work to the meets expectations level.",
    "meets expectations feedback": "You did a good job using descriptive statistics to summarize the key quantities in your data, including mean, median, mode, variance, and minimum/maximum values. Your exploratory data analysis (EDA) provided a solid overview of what the data shows, and your articulation of the null and alternative hypotheses was relevant and clear. You effectively applied Pearson’s correlation coefficient to assess relationships between variables and correctly interpreted the p-values in your hypothesis testing. The inclusion of visualizations like bar charts and scatter plots helped to enhance your data interpretation and presentation.\n\nTo strengthen this further, consider expanding on your explanations of these methodologies and how they apply to real-world scenarios, as this will deepen the practical understanding of your analysis.\n\nGreat work—everything was clearly structured and demonstrated a sound application of statistical methods.",
    "exceeds expectation feedback": "Your analysis showed an impressive level of expertise, applying statistical principles using both spreadsheet software and Python to analyze and interpret data. You not only articulated the differences between the null and alternative hypotheses with a clear example from your project, but you also explained how the significance level influenced decision-making in your hypothesis testing. Conducting the binomial test to analyze binary outcomes was a great addition, demonstrating a deeper understanding of statistical methods.\n\nMoreover, your use of regression analysis to assess relationships and predict outcomes was thorough and well-applied, going beyond the basic criteria. You’ve shown strong technical proficiency and a comprehensive approach to statistical methodologies.\n\nTo continue excelling, consider providing more in-depth comparisons of the tools you used (spreadsheet vs. Python) and their respective advantages for specific types of analysis.\n\nExcellent work overall—your detailed and varied approach clearly exceeds expectations!"
  },
  {
    "ksb": "B6",
    "ksb description": "Identify and explain challenges at work, create solutions to overcome problems and outline lessons learned.",
    "grading primer": "<p><strong>Key terms defined</p><br/><p></strong>Resilience is defined as viewing obstacles as challenges and learning from failure. </p><br/><p><strong>Meets Expectations:</strong></p><p>Learners meet expectations by effectively identifying two challenges encountered in workplace projects. They should use detailed examples to demonstrate how each challenge was addressed, showing a clear problem-solving approach. This can be practically evidenced through work logs, project reports, and feedback from supervisors or colleagues. Reflection on lessons learned should focus on how these insights will inform future work.</p><br/><p><strong>Exceeds Expectations:</strong></p><p>To exceed expectations, learners must explore the root causes and impacts of identified challenges, showcasing innovative or particularly effective solutions with tangible outcomes. Practical evidence can include before-and-after project analysis, stakeholder testimonials, and any recognition received for their contributions. The reflection should convey significant personal development and proactive strategies for applying these learnings in future scenarios.</p><br/><p>Practical evidence might include detailed project documentation, reflective journals, recognition from peers or management, and examples of proactive measures taken in subsequent projects.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Identify a challenge you have faced at work, this does not need to be data related",
      "Describe how utilized resilience to overcome this specific challenge.",
      "Discuss lessons learned as a result of this challenge."
    ],
    "reconstructed exceed expectations criteria": [
      "Utilizing your reflection of lessons learned, outline steps to prevent this challenge in the future."
    ],
    "more work required feedback": "You've made a good start by identifying a challenge you faced at work, showing some understanding of resilience in the workplace. However, to fully meet the criteria, you need to elaborate more on how resilience was demonstrated in your example. It’s important to clearly explain the specific challenge, how you overcame it, and the lessons learned from that experience.\n\nCurrently, your write-up lacks sufficient detail about the process of overcoming the obstacle and how that shaped your learning. Providing more context and depth in your explanation will help showcase your resilience more effectively.\n\nTo improve, revisit your example and add more detail on how you addressed the challenge and the key takeaways from the experience.",
    "meets expectations feedback": "You've provided a well-rounded discussion of how resilience was demonstrated through work-based examples. The challenges you identified were clearly explained, and your approach to overcoming them was well-documented. It was particularly good to see that you outlined the specific lessons learned from overcoming these obstacles, showing how the experience contributed to your growth.\n\nTo enhance this further, consider expanding on how these lessons have impacted your approach to future challenges or difficult situations at work. This will provide a stronger link between your past experiences and your ongoing development.\n\nGreat job—your ability to articulate both the challenges and the learning outcomes demonstrates resilience effectively.",
    "exceeds expectation feedback": "Your write-up showed an impressive level of reflection, with clear examples of  challenges faced during a project at work. You provided relevant, work-based evidence of how you overcame each challenge, demonstrating resilience throughout the process. The lessons you outlined were insightful, showing not only what you learned from these experiences but also how they contributed to your overall development.\n\nYou consistently highlighted how resilience was demonstrated across different points of your project, which added depth to your reflection. The detailed analysis of how you approached each obstacle and what you learned from failure clearly exceeded expectations.\n\nFantastic job—your consistent demonstration of resilience and reflection on overcoming challenges was thorough and insightful!"
  },
  {
    "ksb": "B7",
    "ksb description": "Adapt to changing contexts within the scope of a project, direction of the organisation or data role.",
    "grading primer": "<p><strong>Terms to Define:</strong></p><br/><p>Stakeholder Feedback: Opinions, reactions, and suggestions from individuals or groups with an interest in the project.</p><p>Project Scope: The part of project planning that involves determining and documenting a list of specific project goals, deliverables, tasks, costs, and deadlines.</p><br/><p><strong>Meets Expectations:</strong></p><p>Learners must identify examples of adapting to project scope changes due to organizational shifts or role adjustments. They should explain these shifts and their management of stakeholder feedback. Evidence might include revised project plans, communication logs, and examples of tools or methods used to adapt. The learner should connect these adaptations to enhanced project outcomes.</p><br/><p><strong>Exceeds Expectations:</strong></p><p>Learners should provide a detailed analysis of why changes occurred and illustrate innovative adaptations that significantly improve results. Evidence of stakeholder feedback management could include positive testimonials or increased engagement metrics. Additional evidence could be comprehensive reports showing strategic alignment and reflections detailing foresight and initiative.</p><br/><p>Practical evidence includes amended project plans, stakeholder communications, testimonials. </p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "reconstructed meet expectations criteria": [
      "Identify a work-based example(s) of where you have adapted to changes within the scope of a project or the direction of your organisation or your role as a data analyst.",
      "Clearly explain what/how the scope/direction/role has changed",
      "Explain what the impact of the change was.",
      "Provide specific details of how you adapted to this change."
    ],
    "reconstructed exceed expectations criteria": [
      "Describe the new approach or tool you implemented to meet any new requirements in the scope of the project.",
      "Provide specific examples of how you managed stakeholder feedback during the change.",
      "Give a brief reflection on lessons learned from this change."
    ],
    "more work required feedback": "You’ve made a good start by identifying an example of a project where changes occurred, showing that you recognize the importance of adaptability in your role. However, to meet the expectations, you need to provide more detail on how the scope of the project changed and how you managed stakeholder feedback during this process.\n\nCurrently, your write-up lacks specific examples of how you navigated these changes or addressed stakeholder concerns. This is key to demonstrating adaptability in a work-based setting.\n\nTo improve, revisit your example and provide more specific details about how you managed the changes and the feedback you received from stakeholders.",
    "meets expectations feedback": "You've successfully identified a work-based example where you adapted to changes within a project, clearly explaining how the scope, direction, and role has shifted. Your explanation of the project changes was clear, showing how you maintained alignment during the process.\n\nTo enhance this further, consider reflecting on how these changes impacted your overall approach to project management and what strategies you’ve developed as a result of this experience.\n\nGreat work—your example demonstrates strong adaptability and effective stakeholder management!",
    "exceeds expectation feedback": "Your detailed description of the new approach or tool you implemented to meet the updated project requirements was excellent, showing both adaptability and innovation. You explained how this new approach not only addressed the changes in the project scope but also improved the overall project outcome, highlighting a proactive approach to managing stakeholder feedback during the change, and your lessons learned from this process. \n\nTo further strengthen your write-up, you could provide a comparison of the initial approach versus the new one, detailing why the new approach was more effective. This would give even greater depth to your analysis of how you adapted.\n\nFantastic work—your proactive response to change and the positive impact it had on the project clearly exceeds expectations!"
  },
  {
    "ksb": "K14",
    "ksb description": "Explain the principles of descriptive, predictive and prescriptive analytics and where the principles can be applied in practice.",
    "grading primer": "<p>Across the portfolio a detailed and full description of the principles of <strong>descriptive, predictive, AND prescriptive analytics</strong> should be included. Each must be covered at least once in the portfolio to met expectations overall for the final portfolio submission.  </p><br/><p>Explain the risks and benefits of each of the analytic approaches.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "old meets expectation": "Explain the principles of descriptive, predictive and prescriptive analytics and how to apply them in practice.",
    "reconstructed meet expectations criteria": [
      "Define descriptive analytics referring to specific examples of its use in your work.",
      "Define predictive analytics referring to specific examples of its use in your work.",
      "Define prescriptive analytics referring to specific examples of its use in your work.."
    ],
    "reconstructed exceed expectations criteria": [
      "Evaluate the risks and benefits associated with descriptive analytics.",
      "Evaluate the risks and benefits associated with predictive analytics."
    ],
    "more work required feedback": "You’ve made a good start by providing basic definitions of descriptive, predictive, and prescriptive analytics. However, to meet the expectations, you need to clearly explain how each type of analytics was applied within your project, using specific examples. It’s important to go beyond definitions and demonstrate your understanding of how these methods were used to support decision-making in your project.\n\nCurrently, your write-up lacks sufficient detail on the practical application of these analytics in the project, which is crucial to fully meeting the criteria.\n\nTo improve, revisit your examples and provide more context on how descriptive, predictive, and prescriptive analytics contributed to the project's outcomes.",
    "meets expectations feedback": "You did a good job defining descriptive, predictive, and prescriptive analytics, and you effectively linked these definitions to your project. The examples of how descriptive analytics were used to summarize data and how predictive analytics informed future projections were well-explained. Additionally, your discussion of prescriptive analytics and its role in decision-making was clear, showing an understanding of its practical application in your project.\n\nTo enhance your work further, consider expanding on how these methods worked together to create a cohesive analysis, as this would deepen your explanation of their impact on the project.\n\nGreat job overall—your ability to define and apply these principles within a project demonstrates solid knowledge of the subject.",
    "exceeds expectation feedback": "Your critical evaluation of the risks associated with descriptive, predictive, and prescriptive analytics was excellent, providing thoughtful insights into potential pitfalls and limitations. You provided specific examples of how these risks might manifest in the project, which showed a strong understanding of the challenges that can arise. Your discussion of the benefits of using predictive analytics, particularly how it influenced decision-making and project outcomes, was well-argued and insightful.\n\nTo take this even further, you could explore how these risks could be mitigated in future projects or what steps could be taken to minimize their impact, providing even more depth to your analysis.\n\nFantastic work—your critical evaluation and in-depth discussion of the risks and benefits clearly exceed expectations!"
  },
  {
    "ksb": "S11",
    "ksb description": "Explain the principles of predictive analytics and how to apply them in practice.",
    "grading primer": "<p>Across the portfolio apprentices should clearly explain how <strong>descriptive, predictive, AND prescriptive analytics</strong> have been applied to a particular project or business problem. Each approach must be covered at least once in the portfolio to meet expectations overall for the final portfolio submission. There should be a clear justification for why a particular approach is most appropriate in the context of the business problem. </p><br/><p>Evaluate specific risk and benefits of the approach in the context of the project/business problem making reference to key findings, patterns, visualisation, and/or model output where appropriate.</p><br/><p>Clearly articulate how descriptive or predictive analytical approaches have informed prescriptive analytics and decision making, highlighting key recommendations and takeaways from an analysis. Things to consider:</p><br/><ul><li>Key recommendations from the analysis</li><li>What do historic patterns in data tell you about possible causes/solutions to a problem?</li><li>Are the predictions from a model reliable and able to support good decision making? Why/why not?</li><li>What else is needed to make better informed prescriptive decisions?</li></ul>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "old meets expectation": "Explain the principles of descriptive, predictive and prescriptive analytics and how to apply them in practice.",
    "reconstructed meet expectations criteria": [
      "Explain how descriptive analytics have been applied in a particular project.",
      "Explain how predictive analytics have been applied in a particular project.",
      "Explain how prescriptive analytics have been applied in a particular project."
    ],
    "reconstructed exceed expectations criteria": [
      "Evaluate the risks and benefits of the descriptive analytic methods applied in your project. Includes possible alternative approaches.",
      "Evaluate the risks and benefits of the predictive analytic methods applied in your project. Includes possible alternative approaches.",
      "Evaluate the risks and benefits of the prescriptive analytic methods applied in your project. Includes possible alternative approaches."
    ],
    "more work required feedback": "You've made a good start by describing some basic concepts related to predictive analytics. However, to fully meet the criteria, you need to provide more detail on how you applied predictive analytics in practice at your organization. Specifically, you should focus on presenting evidence of either linear or logistic regression, and clearly describe the insights gained from your analysis.\n\nCurrently, the example lacks sufficient depth in explaining how the predictive model was applied and the specific recommendations or predictions made from the analysis.\n\nTo improve, revisit your example and provide evidence of the regression model used, along with the insights and predictions you derived from it.",
    "meets expectations feedback": "You have successfully demonstrated how you applied predictive analytics in your organization, clearly describing the methods and steps taken. The evidence of your use of linear or logistic regression was well-explained, and the insights gained from your analysis provided useful information. Additionally, your prediction or recommendation based on the results of your analysis was relevant and practical, showing a good understanding of predictive analytics in practice.\n\nTo take this further, consider reflecting on the process—how did the insights shape your decisions, and what impact did your prediction or recommendation have on the project or organization?\n\nGreat job—your ability to apply predictive analytics and use it to make data-driven recommendations was clearly demonstrated.",
    "exceeds expectation feedback": "Your outline of the risks and benefits associated with the predictive analysis was thorough and demonstrated a deep understanding of both the potential advantages and the challenges. You also provided a thoughtful critical evaluation of the predictive model, clearly linking it back to the risks and benefits you outlined, showing a strong analytical approach. Additionally, your discussion of how you assessed the accuracy of the model’s outputs was well-supported by examples and demonstrated technical proficiency.\n\nTo further strengthen your evaluation, consider discussing how you might improve or adjust the model in future iterations, especially in addressing any risks or limitations you encountered.\n\nFantastic work—your critical thinking and evaluation of the predictive analytics model clearly exceed expectations!"
  },
  {
    "ksb": "S13 ",
    "ksb description": "Apply a range of analytical techniques such as data mining, time series forecasting and modelling techniques to identify and predict trends and patterns in data.",
    "grading primer": "<p>Terms to Define:\r</p><p>\r</p><p>Time Series Forecasting: Using historical data to predict future values over time.\r</p><p>Naive Forecasting: A technique where the forecast equals the last observed value.\r</p><p>Exponential Smoothing: A method applying decreasing weights to past observations.</p><p>\r</p><p>Meets Expectations:\r</p><p>Learners should demonstrate applying two time series forecasts, like naive and exponential smoothing, and at least one other data mining technique (e.g., regression, clustering). Each model must be clearly justified within the business context or hypothesis, and visualizations should illustrate model predictions. Learners need to compare error metrics, such as RMSE, to justify the most appropriate model choices. Evidence includes showcasing visualizations, annotated comparisons of error metrics, and clearly interpreted output and metrics, like coefficients and p-values.\r</p><p>\r</p><p>Exceeds Expectations:\r</p><p>To exceed expectations, learners must provide an in-depth analysis and advanced interpretation of models using various metrics and support their model choice with robust justifications. Recommendations should demonstrate a sophisticated understanding of trends, seasonality, and potential business impacts, validated through stakeholder feedback or case studies. Analyses might include scenario projections that align with strategic business goals. Evidence encompasses comprehensive visualizations, detailed error metric comparisons, and communication that showcases how model predictions informed decision-making processes and strategic planning.\r</p><p>\r</p><p>Practical evidence may include screenshots of models, tables comparing error metrics, stakeholder communications validating conclusions, and detailed reports illustrating the model's role in guiding business strategy.</p>",
    "universal criteria": "Consider each item below for apprentice submissions.\n\nNon-negotiable criteria: The bolded item below is a non-negotiable requirement for receiving either meets or exceeds. If this is not done, the learner will receive a grade of Not Evidenced, and will then need to tag the KSB correctly and resubmit. \n\nKSB must be cited where evidence is presented, e.g. (K1)\n\nFormative criteria: These elements do not determine pass/fail for evidence requirements, but are formative elements to demonstrate best practice.  \n\n- avoid acronyms\n- no links\n- avoid excessive bullet points\n- use the STAR format\n- No errors in spelling and grammar\n- Enhance evidence with screenshots or witness statements where applicable \n- Submissions are written in an active voice and for a non-technical audience.\n\n\n",
    "old meets expectation": "Apply a range of analytical techniques such as data mining, time series forecasting and modelling techniques to identify and predict trends and patterns in data.",
    "reconstructed meet expectations criteria": [
      "Provide a visualisation of the model (e.g., time series, scatter plot + line of best fit)",
      "Define the outcome and the predictors in the model",
      "Justify the type of model you chose (e.g., naive forecast, exponential forecast, ARIMS, linear regression, logistic regression)",
      "Interpret error metrics (e.g., RMSE) and/or other model fit statistics (e.g., R-squared, recall, precision) to assess the accuracy of your model's predictions.",
      "Based on your example, explain trends and future predictions (e.g., seasonality, linear trends, reference to specific predicted values examples)."
    ],
    "reconstructed exceed expectations criteria": [
      "Compare error metrics from at least two models to justify which is most suitable (e.g., naive forecast vs. exponential smoothing; linear regression with 1 variable vs. linear regression 2 variables)",
      "Make business-relevant recommendations based on your model."
    ],
    "more work required feedback": "You have not included an explanation of time series forecasting and/or evidence of a time series forecasting model within your project. To evidence a time series forecast, you need to clarify what target/outcome you are predicting across time from your data, as well as the time window you are using. You should include a visualisation of your forecast, including any trend/seasonality and a forecast into the future (time series analysis is not sufficient). You should explain the type of forecasting model you have chosen and why it is appropriate (e.g. why naive/average/exponential smoothing/ARIMA/SARIMA). You should also explain the RMSE/confidence intervals in the forecast (if included). ",
    "meets expectations feedback": "\nYou did a great job presenting a clear visualization of your time series forecasting and connecting it to your project. The choice of forecasting model was well explained, and your use of RMSE to evaluate accuracy demonstrated strong understanding. Your explanation of trends and seasonality was insightful, showing good comprehension of the data.\n\nTo improve, you could expand on your evaluation of the model’s accuracy by discussing additional error metrics or explaining why RMSE was the most appropriate. To reach the next level, try experimenting with a second model, such as a naive or exponential smoothing method, and compare their error metrics to justify your final choice.\n\nKeep up the excellent effort—adding this comparison will enhance your analysis even further.",
    "exceeds expectation feedback": "\nYour use of two time series forecasting models was very well executed, and your comparison of their error metrics was both thorough and insightful. The justification for selecting the most suitable model was clear and well-supported by your analysis. Additionally, your business-relevant recommendations, drawn from the time series analysis, were thoughtful and demonstrated a strong understanding of how forecasting can drive strategic decisions.\n\nTo push this even further, you could enhance your explanation by diving deeper into the specific advantages of each model in different business contexts, considering how external factors might influence model performance over time. Exploring these nuances would further solidify your recommendation and offer greater value to your stakeholders.\n\nExcellent work—your detailed comparison and thoughtful recommendations clearly show an advanced level of analysis!"
  }
]